Catalogs/МИКО_мвРегистрируемыеСобытия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>МИКО_мвРегистрируемыеСобытия</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МИКО_мвВидыЗначимыхСобытий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрыОтбора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоответствиеРеквизитов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаименованиеПоля</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеПоляОбъекта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/МИКО_мвВидыЗначимыхСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>МИКО_мвВидыЗначимыхСобытий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВходящийЗвонок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсходящийЗвонок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Документ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтактВТечениеДня</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Справочник</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/МИКО_мвРегистрируемыеСобытия/Forms/ФормаЭлемента/Ext/Form/Module.bsl
// #Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ.

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//НастройкиКомпоновки = РеквизитФормыВЗначение("Объект").ПараметрыОтбора.Получить();
	//ИнициализироватьКомпоновщикНастроек(НастройкиКомпоновки);
	//Объект.СрокДействия = ?(ЗначениеЗаполнено(Объект.СрокДействия), Объект.СрокДействия, 3);	
	
	// Заполним реквизиты для предопределенных элементов.
	Если НЕ ЗначениеЗаполнено(Объект.ВидСобытия) Тогда
		Если Объект.Ссылка = Справочники.МИКО_мвРегистрируемыеСобытия.ВходящийЗвонок Тогда
			Объект.ВидСобытия = Перечисления.МИКО_мвВидыЗначимыхСобытий.ВходящийЗвонок;
		ИначеЕсли Объект.Ссылка = Справочники.МИКО_мвРегистрируемыеСобытия.ИсходящийЗвонок Тогда
			Объект.ВидСобытия = Перечисления.МИКО_мвВидыЗначимыхСобытий.ИсходящийЗвонок;
		Иначе
			Объект.ВидСобытия = Перечисления.МИКО_мвВидыЗначимыхСобытий.Документ;
		КонецЕсли; 
	КонецЕсли;
	
	ЗаполнитьСписокВидовОбъекта(Объект.ВидСобытия);
	ЗаполнитьТаблицуРеквизитовОбъекта(Строка(Объект.ВидСобытия), Объект.ВидОбъекта);
	
	// Заполним список доступных для настройки полей. 
	
	ПараметрыОтбора = Новый Структура("НаименованиеПоля");
	АнализируемыеПоля = МИКО_мвМаршрутизацияЗвонковПовтИсп.АнализируемыеПоля();
	Для Каждого Поле Из АнализируемыеПоля Цикл
		
		ПараметрыОтбора.НаименованиеПоля = Поле.Ключ;
		НайденныеСтроки = Объект.СоответствиеРеквизитов.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСтроки.Количество() = 0 Тогда
			СтрокаТаблицыРеквизитов = Объект.СоответствиеРеквизитов.Добавить();
			СтрокаТаблицыРеквизитов.НаименованиеПоля = Поле.Ключ;
		Иначе
			СтрокаТаблицыРеквизитов = НайденныеСтроки[0];
		КонецЕсли;
		СтрокаТаблицыРеквизитов.ТипПоля = Поле.Значение;
		
	КонецЦикла;
	
	ЗаполнитьПредставленияПолей();
	Объект.СоответствиеРеквизитов.Сортировать("НаименованиеПоля");
		
КонецПроцедуры // ПриСозданииНаСервере()

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ИнициализироватьКомпоновщикНастроек();
	Справочники.МИКО_мвРегистрируемыеСобытия.УстановитьПараметрыОтбора(
		КомпоновщикНастроекКомпоновкиДанных, ТекущийОбъект.ПараметрыОтбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьОтображениеФормы(Объект.ВидСобытия);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	НастройкиКомпоновки = КомпоновщикНастроекКомпоновкиДанных.ПолучитьНастройки();
	Отбор = МИКО_стОбщегоНазначения.СкопироватьМассив(НастройкиКомпоновки.Отбор.Элементы);
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	СериализаторXDTO.ЗаписатьXML(ЗаписьXML, Отбор);
	ТекущийОбъект.ПараметрыОтбора = ЗаписьXML.Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаполнитьПредставленияПолей();
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ.

&НаКлиенте
Процедура ВидСобытияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Объект.ВидСобытия <> ВыбранноеЗначение Тогда
		
		Объект.ВидОбъекта = "";
		
		ЗаполнитьСписокВидовОбъекта(ВыбранноеЗначение);
		ОбновитьОтображениеФормы(ВыбранноеЗначение);
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОбъектаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Объект.ВидОбъекта <> ВыбранноеЗначение Тогда
		
		Объект.ВидОбъекта = ВыбранноеЗначение;
		
		ВидОбъектаОбработкаВыбораНаСервере();
		
		ОбновитьОтображениеФормы(Объект.ВидСобытия);
		
		Для Каждого СтрокаТаблицы Из Объект.СоответствиеРеквизитов Цикл
			СтрокаТаблицы.НаименованиеПоляОбъекта = "";
			СтрокаТаблицы.ПредставлениеПоляОбъекта = "";
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВидОбъектаОбработкаВыбораНаСервере()
	
	ЗаполнитьТаблицуРеквизитовОбъекта(Строка(Объект.ВидСобытия), Объект.ВидОбъекта);
	ИнициализироватьКомпоновщикНастроек();
	
КонецПроцедуры

&НаКлиенте
Процедура СрокДействияПриИзменении(Элемент)
	
	ОбновитьОтображениеДекарацийФормы(Объект.ВидСобытия);
	
КонецПроцедуры

&НаКлиенте
Процедура СоответствиеРеквизитовПриАктивизацииСтроки(Элемент)
	
	ЗаполнитьСписокДоступныхРеквизитовПоляСобытия(Элементы.СоответствиеРеквизитов.ТекущиеДанные.ТипПоля);
	
КонецПроцедуры

&НаКлиенте
Процедура СоответствиеРеквизитовПредставлениеПоляОбъектаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтрокиРеквизитов = ТаблицаРеквизитов.НайтиСтроки(Новый Структура("Представление", ВыбранноеЗначение));
	
	Элементы.СоответствиеРеквизитов.ТекущиеДанные.НаименованиеПоляОбъекта = СтрокиРеквизитов[0].Имя;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЧЕЕ

// Изменяет вид формы в зависимости от установленных пользователем параметров
//
&НаКлиенте
Процедура ОбновитьОтображениеФормы(ВидСобытия)
	
	Если ВидСобытия = ПредопределенноеЗначение("Перечисление.МИКО_мвВидыЗначимыхСобытий.ВходящийЗвонок")
	 Или ВидСобытия = ПредопределенноеЗначение("Перечисление.МИКО_мвВидыЗначимыхСобытий.ИсходящийЗвонок") Тогда
	 
	 	Объект.ВидОбъекта = Неопределено;
		
		Элементы.СтраницаНастройкиДокумента.Доступность = Ложь;
		
		Элементы.ВидСобытия.ТолькоПросмотр    = ЗначениеЗаполнено(Объект.Ссылка);
		Элементы.ВидОбъекта.Видимость         = Ложь;
		Элементы.ДекорацияБессрочно.Видимость = Ложь;
		Элементы.ДекорацияФормула.Видимость   = Истина;
		
		Элементы.Наименование.СписокВыбора.Очистить();
		Элементы.Наименование.СписокВыбора.Добавить(ВидСобытия);
		
	ИначеЕсли ВидСобытия = ПредопределенноеЗначение("Перечисление.МИКО_мвВидыЗначимыхСобытий.Документ")
		  Или ВидСобытия = ПредопределенноеЗначение("Перечисление.МИКО_мвВидыЗначимыхСобытий.Справочник") Тогда
		
		Элементы.СтраницаНастройкиДокумента.Доступность = ЗначениеЗаполнено(Объект.ВидОбъекта);
		
		Элементы.ВидСобытия.Доступность       = Истина;
		Элементы.ВидОбъекта.Видимость         = Истина;
		Элементы.ВидОбъекта.Заголовок         = Строка(ВидСобытия);
		
		Бессрочно = (ВидСобытия = ПредопределенноеЗначение("Перечисление.МИКО_мвВидыЗначимыхСобытий.Справочник")
			И Объект.СрокДействия = 0);
		
		Элементы.ДекорацияБессрочно.Видимость = Бессрочно;
		Элементы.ДекорацияФормула.Видимость   = Не Бессрочно;
		
		Элементы.Наименование.СписокВыбора.Очистить();
		Элементы.Наименование.СписокВыбора.Добавить(Строка(ВидСобытия)+ ": " + Элементы.ВидОбъекта.ТекстРедактирования);
		
	Иначе
		
		Элементы.СтраницаНастройкиДокумента.Доступность = Ложь;
		
		Элементы.ВидСобытия.Доступность       = Истина;
		Элементы.ВидОбъекта.Видимость         = Ложь;
		Элементы.ДекорацияБессрочно.Видимость = Ложь;
		Элементы.ДекорацияФормула.Видимость   = Истина;
		
	КонецЕсли;
	
	ОбновитьОтображениеДекарацийФормы(ВидСобытия);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображениеДекарацийФормы(ВидСобытия)
	
	Если ВидСобытия = ПредопределенноеЗначение("Перечисление.МИКО_мвВидыЗначимыхСобытий.ВходящийЗвонок")
	 Или ВидСобытия = ПредопределенноеЗначение("Перечисление.МИКО_мвВидыЗначимыхСобытий.ИсходящийЗвонок") Тогда
	 
	 	Элементы.ДекорацияБессрочно.Видимость = Ложь;
		Элементы.ДекорацияФормула.Видимость   = Истина;
		
	ИначеЕсли ВидСобытия = ПредопределенноеЗначение("Перечисление.МИКО_мвВидыЗначимыхСобытий.Документ")
		  Или ВидСобытия = ПредопределенноеЗначение("Перечисление.МИКО_мвВидыЗначимыхСобытий.Справочник") Тогда
		
		Бессрочно = (ВидСобытия = ПредопределенноеЗначение("Перечисление.МИКО_мвВидыЗначимыхСобытий.Справочник")
			И Объект.СрокДействия = 0);
		
		Элементы.ДекорацияБессрочно.Видимость = Бессрочно;
		Элементы.ДекорацияФормула.Видимость   = Не Бессрочно;
		
	Иначе
		
		Элементы.ДекорацияБессрочно.Видимость = Ложь;
		Элементы.ДекорацияФормула.Видимость   = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПредставленияПолей()
	
	Для Каждого СтрокаТаблицыРеквизитов Из Объект.СоответствиеРеквизитов Цикл
		
		Если СтрокаТаблицыРеквизитов.НаименованиеПоля = "НомерТелефона" Тогда
			СтрокаТаблицыРеквизитов.ПредставлениеПоля = "Номер телефона";
		ИначеЕсли СтрокаТаблицыРеквизитов.НаименованиеПоля = "КонтактноеЛицо" Тогда
			СтрокаТаблицыРеквизитов.ПредставлениеПоля = "Контактное лицо";
		Иначе
			СтрокаТаблицыРеквизитов.ПредставлениеПоля = СтрокаТаблицыРеквизитов.НаименованиеПоля;
		КонецЕсли;
		
		СтрокиРеквизитов = ТаблицаРеквизитов.НайтиСтроки(Новый Структура("Имя", СтрокаТаблицыРеквизитов.НаименованиеПоляОбъекта));
		Если СтрокиРеквизитов.Количество() > 0 Тогда
			СтрокаТаблицыРеквизитов.ПредставлениеПоляОбъекта = СтрокиРеквизитов[0].Представление;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВидовОбъекта(ВидСобытия)
	
	Если ВидСобытия = Перечисления.МИКО_мвВидыЗначимыхСобытий.Документ
	 Или ВидСобытия = Перечисления.МИКО_мвВидыЗначимыхСобытий.Справочник Тогда
		
		Элементы.ВидОбъекта.СписокВыбора.Очистить();
		
		МИКО_стОбщегоНазначения.ЗаполнитьКоллекциюСвойств(
			Элементы.ВидОбъекта.СписокВыбора,
			Справочники.МИКО_мвРегистрируемыеСобытия.ВидыОбъектовМетаданных(Строка(ВидСобытия)));
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокДоступныхРеквизитовПоляСобытия(ТипПоля)
	
	СписокВыбора = Элементы.СоответствиеРеквизитовПредставлениеПоляОбъекта.СписокВыбора;
	СписокВыбора.Очистить();
	
	Для Каждого Реквизит Из ТаблицаРеквизитов Цикл
		
		Если ПроверитьСоответствиеТипа(Реквизит.Тип, ТипПоля) Тогда
			СписокВыбора.Добавить(Реквизит.Представление, Реквизит.Представление,, БиблиотекаКартинок.Реквизит);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуРеквизитовОбъекта(ВидСобытия, ВидОбъекта)
	
	Если Не ПустаяСтрока(ВидСобытия) И Не ПустаяСтрока(ВидОбъекта) Тогда
		
		ТаблицаРеквизитов.Загрузить(Справочники.МИКО_мвРегистрируемыеСобытия.РеквизитыОбъектаМетаданных(ВидСобытия, ВидОбъекта));
		
	КонецЕсли;
	
КонецПроцедуры

// Выполняет инициализацию компоновщика настроек.
//
&НаСервере
Процедура ИнициализироватьКомпоновщикНастроек(НастройкиКомпоновки = Неопределено)
	
	Если ПустаяСтрока(Объект.ВидОбъекта) Тогда
		Возврат;
	КонецЕсли;
	
	// Подготовим запрос для получения списка полей объекта конфигурации.
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	Источник.*
		|ИЗ
		|	%ВидОбъекта%.%ИмяОбъекта% КАК Источник";
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%ВидОбъекта%", Строка(Объект.ВидСобытия));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%ИмяОбъекта%", Объект.ВидОбъекта);
	
	// Подготовим инфрормацию для процессора компоновки данных
	СхемаКомпоновкиДанных = Справочники.МИКО_мвРегистрируемыеСобытия.ПолучитьМакет("СхемаОтбораДокументов");
	СхемаКомпоновкиДанных.НаборыДанных[0].Запрос = ТекстЗапроса;
	
	МИКО_мвМаршрутизацияЗвонковСервер.ИнициализироватьКомпоновщикНастроекКомпоновкиДанных(
		КомпоновщикНастроекКомпоновкиДанных,
		СхемаКомпоновкиДанных,
		УникальныйИдентификатор,
		?(ТипЗнч(НастройкиКомпоновки) = Тип("НастройкиКомпоновкиДанных"), НастройкиКомпоновки, Неопределено)
	);
	
КонецПроцедуры // ИнициализироватьКомпоновщикНастроек()

&НаКлиентеНаСервереБезКонтекста
Функция ПроверитьСоответствиеТипа(Знач ОписаниеТипа, Знач ДопустимыеТипы)

	Если ОписаниеТипа = ДопустимыеТипы 
	 Или ОписаниеТипа.ПривестиЗначение() = ДопустимыеТипы.ПривестиЗначение() Тогда
	 	Возврат Истина;
	КонецЕсли;
	
	Для каждого Тип Из ДопустимыеТипы.Типы() Цикл
		Если ОписаниеТипа.СодержитТип(Тип) Тогда
			Возврат Истина;
		КонецЕсли; 
	КонецЦикла; 	

	Возврат Ложь;
	
КонецФункции // ПроверитьСоответствиеТипа()


// #КонецОбласти
